---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
source: html/88b648dc-4fbf-5712-253f-34d152f2c296.htm
---
# StructuralSectionIParallelFlange Members

Creates a new instance of Structural Section I Parallel Flange shape with the associated set of parameters,
 used to attach to structural element.